Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_en-US_pt-PT_repaired.tmx
Source language: en_us
Languages: pt_pt

source: Link and disconnect your social media accounts
pt_pt: Associa e desassocia as tuas contas das redes sociais

source: Accomplish impressive feats and win prizes with the new Battle Pass!
pt_pt: Mostra o que vales e ganha prémios no novo Passe de Batalha!

source: Play in the event to earn Rune Spheres and upgrade the class skills of multiple heroes at once!
pt_pt: Participa no evento, ganha Esferas de Runas e melhora as habilidades de classe de vários heróis ao mesmo tempo!

source: The Undead forces are gathering at the borders!
pt_pt: As forças dos Mortos-vivos estão a juntar-se nas fronteiras!

source: Participate in a unique event and dive into dark secrets of the kingdom of Graven!
pt_pt: Participa num evento único e descobre os segredos sombrios do reino de Graven!

source: Korean Won
pt_pt: Won coreano

source: Hello! You can actually play the whole game for free. It might take a little more time though: for example, the raid function lets you save lots of time. Still, there are plenty of ways to earn free resources: you can get free Energy three times a day, visit Theatre or watch videos from Boxy, check the Newsfeed section or our official Facebook page. Have a good time in Hero Wars!
pt_pt: Olá! É possível jogar todo o jogo de graça, mas pode demorar um pouco mais: por exemplo, a funcionalidade de incursão permite que poupes muito tempo. No entanto, existem diversas formas de ganhar recursos sem custos: podes receber energia gratuitamente três vezes por dia: visita o Theatre, vê vídeos do Boxy e consulta o mural de notícias ou a nossa página oficial no Facebook. Diverte-te com o Hero Wars!

source: Engage in Unique Skyship Battles!
pt_pt: Entra em combates únicos com aeronaves!

source: Don’t miss a chance to power up your Heroes!
pt_pt: Não percas a oportunidade de fortalecer os teus Heróis!

source: Grab an outfit for Lars, Krista, and Daredevil and try them out in battles!
pt_pt: Experimenta novos visuais para Lars, Krista e Daredevil!

source: See improved Morrigan in action in our new event!
pt_pt: Espreita a Morrigan melhorada em ação no evento!

source: Beware, a new Titan is coming to the Dominion!
pt_pt: Atenção, vai chegar um novo Titã ao Domínio!

source: WOULD YOU RATHER…
pt_pt: PREFERIAS...

source: Brazilian Real
pt_pt: Real brasileiro

source: Thanks for taking the time to write a review!
pt_pt: Obrigado pela tua avaliação!

source: The thing is, Hero Wars is a diverse game, so it’s quite a challenge to put it all in one short ad.
pt_pt: A verdade é que o Hero Wars é um jogo diversificado, pelo que é um grande desafio mostrar tudo num pequeno anúncio.

source: We’re sorry to see you find the ad irrelevant, and we’ll surely pass your feedback to our marketing department.
pt_pt: Lamentamos que consideres o anúncio irrelevante e passaremos a tua opinião para o departamento de marketing.

source: We hope though that you’ll give Hero Wars another try - there’s a lot to discover!
pt_pt: Esperamos, no entanto, que dês uma nova oportunidade ao Hero Wars, porque há muito para descobrir!

source: This February's hero of the month is Araсhne, a Progress warrior!
pt_pt: A heroína deste mês é Arachne, uma guerreira do Progresso!

source: - May is a month of celebration and great deals!
pt_pt: - Maio é o mês dos festejos e grandes promoções!

source: Don't miss out on fun and amazing offers!
pt_pt: Não percas ofertas incríveis e divertidas!

source: LV.1
pt_pt: Nv.1

source: Artifact Boxes
pt_pt: Caixas de Artefactos

source: An avalanche of brand new stuff!
pt_pt: Estão a chover novidades!

source: The Honorable Ones Watch the Way of Honor heroes demonstrate their bravery and unleash even greater powers in the new special event!
pt_pt: Os Honrados Os heróis do Caminho da Honra vão mostrar o que valem neste novo evento especial, com poderes ainda melhores!

source: Lunar Skins Clad in their new outfits, Mushy and Shroom, Corvus, and Morrigan shine bright in the festive lights!
pt_pt: Visuais Lunares Vestidos a rigor, Mushy e Shroom, Corvus e Morrigan brilham sob as luzes festivas!

source: Upgrade Mushy and Shroom's skin even further for more vibrant colors!
pt_pt: Melhora ainda mais o visual de Mushy e Shroom e obtém cores ainda mais vibrantes!

source: A Chilly Adventure Head to the Forest of Wishes and take part in a fairytale challenge for true heroes!
pt_pt: Uma Aventura Gelada Vai à Floresta dos Desejos e participa num desafio fantástico para verdadeiros heróis!

source: The New Year is coming in hot!
pt_pt: O Ano Novo está aí!

source: Fight alongside your trusted allies!
pt_pt: Luta junto dos teus aliados!

source: • Hero Rework: Lian is now twice as cute and twice as dangerous.
pt_pt: • Renovação de herói: Lian passou a ser duas vezes mais adorável e perigosa.

source: SUMMON
pt_pt: INVOCA

source: Hero Wars is a diverse game, so it’s quite a challenge to put it all in one short ad.
pt_pt: O Hero Wars é um jogo diversificado, pelo que é um grande desafio mostrar tudo num pequeno anúncio.

source: We hope though that you’ll give Hero Wars another chance with our new Tower gameplay!
pt_pt: Esperamos, no entanto, que dês uma nova oportunidade ao Hero Wars e experimentes o novo modo Torre!

source: Try to use all four golden mirrors to point the light beam.
pt_pt: Tenta utilizar os quatro espelhos dourados para apontares o feixe de luz.

source: Don't be afraid to experiment with the position of the mirrors until you straighten the beam :) Good luck!
pt_pt: Não tenhas medo de fazer experiências com a posição dos espelhos até endireitares o feixe :) Boa sorte!

source: An Update of Incredible Power!
pt_pt: Uma atualização incrivelmente poderosa!

source: Hero Bundles Fight your enemies and collect special bundles to upgrade all your heroes' main stats!
pt_pt: Conjuntos de Herói Combate os teus inimigos e recolhe conjuntos especiais para melhorar os teus heróis!

source: It's a great way to power-up your team AND find out more about the Guardians.
pt_pt: É uma excelente maneira de reforçar a tua equipa E descobrir mais sobre os Guardiões.

source: Their history is full of mysteries!
pt_pt: A sua história está cheia de mistérios!

source: Talismans for All Isaac, Orion, and Aidan are ready to join the fray with their first Talismans, while Dante, Heidi, and Chabba now have two of the powerful artifacts each!
pt_pt: Talismãs para todos Isaac, Orion e Aidan estão a postos para a luta com os seus primeiros Talismãs, enquanto que Dante, Heidi e Chabba têm agora dois poderosos artefactos cada um!

source: It's time to power-up!
pt_pt: Está na altura de ficar mais forte!

source: Don’t miss out on new Sea Skins for Isaac and Julius!
pt_pt: Não percas os novos Visuais do Mar para Isaac e Julius!

source: Before her fateful fight with Morth Chrone, Octavia used to rule the Dominion, and tales of her beauty traveled well beyond its borders.
pt_pt: Antes do trágico combate com Morth Chrone, Octavia governava o Domínio e as histórias da sua beleza percorriam o mundo.

source: But the poison of a bone dragon changed her.
pt_pt: Mas o veneno de um osso de dragão mudou-a.

source: The Empress disappeared from the public eye, losing her mind and wasting away by the day.
pt_pt: A Imperatriz desapareceu, ficando louca e enfraquecida.

source: But now she's back to take her place among the Support Heroes of the Eternity Faction!
pt_pt: Mas agora ela regressou para tomar o seu lugar entre os Heróis de Suporte na Fação da Eternidade!

source: Octavia uses her magic mirror to reflect enemy damage and also helps her allies dodge.
pt_pt: Octavia usa o seu espelho mágico para refletir danos no inimigo e ajudar os seus aliados a desviar-se.

source: Witness her terrifying might in Hero Wars!
pt_pt: Testemunha o seu poder aterrador em Hero Wars!

source: They need air!
pt_pt: Dá-lhes oxigénio!

source: Click
pt_pt: Clica em

source: Celestial Skin Sale!
pt_pt: Promoção de Visuais Celestiais

source: The new Battle Pass is full of resources and decorations!
pt_pt: O novo Passe de Batalha está cheio de recursos e decorações!

source: Play for some loot!
pt_pt: Obtém o saque!

source: This Month's Hero is Elmir!
pt_pt: Elmir é o Herói deste mês!

source: Power up your Heroes and get a Skin+ for Celeste!
pt_pt: Melhora heróis e ganha um Visual+ para Celeste!

source: Mushi and Shroom are here for new adventures!
pt_pt: Mushi e Shroom estão prontos para novas aventuras!

source: Expand your wardrobe, upgrade Octavia's outfit in the event shop, and check out our resource bundles!
pt_pt: Aumenta o teu guarda-roupa, melhora o visual de Octavia na loja do evento e espreita os nossos conjuntos de recursos!

source: Hi! Gold is an extremely important resource in Island Questaway. There are quite a few ways to get it :) For instance, be sure to explore every chest and crate on the Islands to increase the amount of gold. Of course, the best way to earn it is by completing orders on the farm. Good luck!
pt_pt: Olá! O ouro é um recurso extremamente importante na Ilha Questaway. Existem algumas formas de consegui-lo :) Por exemplo, não te esqueças de explorar todas as arcas e caixas da Ilha, para aumentares o teu ouro. Claro, a melhor forma de ganhá-lo é através. Claro, a melhor maneira de conseguir ouro é completar ordens na quinta. Boa sorte!

source: Power up Astaroth, Galahad, and Aurora with new epic outfits and challenge the Archdemon himself!
pt_pt: Melhora Astaroth, Galahad e Aurora com novos visuais épicos e desafia o próprio Grão-Demónio!

source: Don't miss out on this chance to get the new Thunder Skins for Astaroth, Galahad, and Aurora!
pt_pt: Não percas esta oportunidade de obter novos Visuais Trovão para Astaroth, Galahad e Aurora!

source: Complete quests and earn themed Coins and Chests to stock up on useful resources and power up your team.
pt_pt: Conclui missões e ganha Moedas e Baús temáticos para obter recursos úteis e melhorar a tua equipa.

source: This is the perfect opportunity to both dress up your Heroes and obtain legendary powers!
pt_pt: Esta é a oportunidade perfeita para vestir os teus Heróis e conseguir poderes lendários!

source: I never knew anxiety until I played this
pt_pt: Só agora percebo o que é a ansiedade

source: • New winter skins.
pt_pt: • Novos visuais de inverno.

source: ASSEMBLE YOUR DREAM TEAM!
pt_pt: CRIA A TUA EQUIPA DE SONHO!

source: HONEY, I'M H...
pt_pt: QUERIDA, CHEG...

source: The great Empress joins the Heroes of the Dominion!
pt_pt: A grande Imperatriz junta-se a Heróis do Domínio!

source: New holiday outfits and Skin+ for Mushy & Shroom!
pt_pt: Novos visuais e Visuais+ para Mushy e Shroom!

source: FALL IN LOVE
pt_pt: APAIXONARES-TE

source: Defeat your enemy and grow your dragon
pt_pt: Derrota o inimigo e faz o teu dragão crescer

source: Thank you for your review, have a good time playing Hero Wars!
pt_pt: Obrigado pela tua avaliação. Diverte-te a jogar o Hero Wars!

source: YOU
pt_pt: TU

source: Beneath the Starlight
pt_pt: Sob a luz das estrelas

source: Exchange your diamond trophies for gold ones
pt_pt: Troca os troféus de diamante por versões em ouro

source: Get powerful talismans for Ginger, Kayla, Luther, Mojo, Octavia, and Dark Star during the new event!
pt_pt: Obtém talismãs poderosos para a Ginger, a Kayla, o Luther, o Mojo, a Octavia e a Estrela Sombria durante o novo evento!

source: Learn More
pt_pt: Saber mais

source: Galactic Week is on!
pt_pt: Chegou a Semana Galáctica!

source: Test improved Chabba out and upgrade your Guardians & Titans with unique offers!
pt_pt: Experimenta o Chabba renovado e aproveita as promoções para melhorar os Guardiães e Titãs!

source: English
pt_pt: Português (Portugal)

source: Summertime Joy! Tropical Fair A seasonal wind is in the forecast, bringing juicy frames and avatars, and toppling the cost of resources at the Tropical Shop! Complete event quests to get Coins and set yourself up with themed items. There’s a juicy summer ahead!
pt_pt: Alegria de Verão! Feira Tropical Os ventos quentes de verão trazem consigo molduras e avatares novos, além de reduzirem os preços dos materiais na loja tropical! Obtém moedas do evento ao concluir missões e não percas os itens temáticos! O verão vai ser fantástico!

source: Grab this chance to obtain Soul Stones and Celestial Skins for Kayla and Octavia during our Japan-inspired three-day sale!
pt_pt: Aproveita a oportunidade de obter Pedras Anímicas e Visuais Celestiais para Kayla e Octavia durante a nossa promoção de três dias de inspiração japonesa!

source: The Empress's outfit can be additionally upgraded with event coins.
pt_pt: O visual da Imperatriz pode ser melhorado com moedas do evento.

source: Let Octavia's beauty blossom like a sakura tree!
pt_pt: Vê a beleza de Octavia a desabrochar como uma cerejeira!

source: Also, the special shop will offer useful resources and other pleasant surprises for you!
pt_pt: Além disso, a loja oficial irá oferecer recursos úteis e outras surpresas agradáveis!

source: Learn the mysteries of the Runic Forest, meet a new Guardian, check out thrilling activities, and get exciting rewards!
pt_pt: Explora os mistérios da Floresta Rúnica, conhece um novo Guardião, espreita atividades épicas e recompensas incríveis!

source: She is wicked! Meow yeah!
pt_pt: Cuidado com ela! Miiiaaaaau!

source: Build a lasting legacy!
pt_pt: Cria um legado!

source: Lara Croft in Dominion!
pt_pt: Lara Croft no Domínio!

source: Hi! We're sorry that you feel this way :( Make sure you use all possible ways to get more energy! Like burning fruits in the cauldron, opening chests on the Island, completing boat orders, and many more! And don't forget that reaching a new level fills the energy bar to the max :) Also, thank you for your feedback as it helps us improve the game!
pt_pt: Olá! Lamentamos que te sintas assim :( Tenta usar todas as formas possíveis de ganhar mais energia! Podes cozinhar frutas no caldeirão, abrir arcas na Ilha, concluir ordens de barco e muito mais! Além disso, não te esqueças que alcançar um nível novo enche a barra de energia ao máximo :) Obrigado pelos comentários. Ajudam-nos a melhorar o jogo!

source: Become a legend!
pt_pt: Torna-te uma lenda!

source: Dozens of exciting levels and an inspiring story about how adventures can help you test your strength await you!
pt_pt: Aguardam-te dezenas de emocionantes níveis e uma história sobre como as aventuras te podem ajudar a testar a tua força!

source: A charge into eternity!
pt_pt: Uma carga até à eternidade!

source: Unity of the Damned Check out the new special event where the Way of Eternity heroes can test their mettle in combat and become even stronger!
pt_pt: União dos Malditos Não percas o novo evento especial onde os heróis do Caminho da Eternidade podem mostrar o que valem em combate e tornarem-se ainda mais fortes!

source: New power awaits!
pt_pt: Há poder à tua espera!

source: Let's get ready for summertime together! Sunny days are around the corner! Visit our sale for Beach Skins for Cleaver, Artemis, and Kai so the heroes can enjoy their summer outfits. It's going to be blazing hot!
pt_pt: Vamos preparar-nos juntos para o verão! Dias ensolarados estão ao virar da esquina! Espreita as promoções com visuais de praia para Cleaver, Artemis e Kai. Ajuda-os a aproveitar o verão. Vai ser escaldante!

source: 5 levels later...
pt_pt: 5 níveis depois...

source: FAIL Try again?
pt_pt: PERDESTE Tentar de novo?

source: Power up your Eternity Heroes!
pt_pt: Melhora os teus Heróis da Eternidade!

source: Survive
pt_pt: Sobrevive

source: Don’t miss out on this unique event!
pt_pt: Não percas este evento único!

source: You can now check out our new Tower game at the City Gate!
pt_pt: Já podes experimentar o modo Torre no Portão da Cidade!

source: Radiance of Creation!
pt_pt: A Luz da Criação!

source: Change Password
pt_pt: Alterar palavra-passe

source: Jump into the adventure!
pt_pt: Parte à aventura!

source: Free Gold and Energy!
pt_pt: Ouro e Energia grátis!

source: Click the image to get free Gold and Energy!
pt_pt: Clica na imagem para obtê-los!

source: Mysterious chest is ready to bestow a gift upon you! – Come get a new unique Hero for your army! Become stronger from the very start! And win a Major War!
pt_pt: O baú misterioso está pronto para te dar um presente! Vem receber um novo Herói exclusivo para o teu exército! Torna-te mais forte deste o início e vence uma Grande Guerra!

source: Unstoppable Force!
pt_pt: Força Imparável!

source: Way of Nature: Great Mage Kai
pt_pt: Caminho da Natureza: Mago Kai

source: In-game purchases endeed help you progress a bit faster: for example, the raid function lets you save lots of time.
pt_pt: As compras no jogo ajudam realmente a avançar um pouco mais rápido: por exemplo, a funcionalidade de incursão permite-te poupar muito tempo.

source: Still, you can play the whole game for free, there's a lot of ways to earn free resources!
pt_pt: No entanto, podes jogar todo o jogo de graça e há muitas formas de ganhar recursos sem custos!

source: Have a good time playing Hero Wars!
pt_pt: Diverte-te com o Hero Wars!

source: Compete against other players and win prizes!
pt_pt: Compete com outros jogadores e ganha prémios!

source: If you'd like to feel love in the air, Chabba, Octavia, and Ziri's enchanting new outfits are a must-have—and you certainly can't miss the Hearts of Dominion event! It's a great chance to go that extra mile with Chabba's Skin and purchase a special Gift of Love chest. Join the romantic fun and games by spending energy, opening chests, going on Expeditions, and completing other event quests to earn Love Coins for the Flower Shop.
pt_pt: Sentes o amor no ar? As novas fatiotas encantadas de Chabba, Octavia e Ziri têm algo a ver com isso. Não percas o evento Corações do Domínio! Aproveita para melhorar o visual de Chabba e comprar o baú Dádiva do Amor especial. Gasta energia, abre baús, participa em Expedições e completa missões do evento para ganhar Moedas do Amor que podes gastar na Loja de Flores.

source: Grow the most powerful tree with your guild!
pt_pt: Cultiva a árvore mais poderosa com a tua guilda!

source: All eyes on the Chaos Heroes!
pt_pt: Que todos vejam os Heróis do Caos!

source: Battle enemies in this idle war RPG set in the land of the Dominion.
pt_pt: Combate inimigos neste RPG ocioso que ocorre na terra do Domínio.

source: Collect heroes, earn new powers and skills, and level them up.
pt_pt: Recolhe heróis, ganha novos poderes e habilidades e sobe-os de nível.

source: Achieve victory in war to take your place beside the heroes from legends.
pt_pt: Consegue a vitória na guerra e assume o teu lugar, juntamente aos heróis das lendas.

source: Xe'Sha is here!
pt_pt: Xe'Sha chegou!

source: Join the mysterious adventure!
pt_pt: Junta-te a uma aventura misteriosa!

source: The magnificent Lara Croft is used to working on her own, but new adventures require new acquaintances, and who better than experienced heroes! The most ancient secrets - and demons! - of Dominion are to be uncovered, so the Guardians are really interested in this expedition as well. Take part in the event and unlock the legendary Lara Croft, three skins for her, and a special Talisman, unique to her. Mysteries await, find them in style!
pt_pt: A incrível Lara Croft está habituada a trabalhar sozinha, mas novas aventuras exigem novos contactos. E não há ninguém melhor que heróis experientes! Os segredos mais antigos, assim como os demónios do Domínio, estão prestes a ser desvendados, o que suscita o interesse dos Guardiões. Participa no evento e desbloqueia a lendária Lara Croft, três visuais e um Talismã especial, exclusivo para ela. Os Mistérios aguardam-te, por isso... desvenda com estilo!

source: It’s time to load up on gold and other resources!
pt_pt: Toca a recolher ouro e outros recursos!

source: Don’t miss out a 60% discount on useful resources for upgrading your Heroes!
pt_pt: Um desconto de 60% em recursos úteis para melhorar os teus heróis!

source: Meet Oya and add her to your team!
pt_pt: Conhece Oya e adiciona-a à tua equipa!

source: An autumnal transformation! Demonic Skins Ishmael and Soleil have been exposed to the power of the Abyss and are ready to tear their enemies apart! Soleil’s Skin can be upgraded even further by completing quests, and will power up immensely! Magic Tree A Magic Tree has grown again on Dominion’s main square, all in the gold and crimson colors of the season! Team up with your guildmates, show off your agricultural talent, and get unique prizes! Start the season with magnificent victories!
pt_pt: Uma transformação outonal! Visuais Demoníacos Ishmael e Soleil foram expostos ao poder do Abismo e estão prontos para esfrangalhar os inimigos deles! Podes concluir missões para melhorar ainda mais o visual de Soleil para que se torne mais poderoso! Árvore Mágica A Árvore Mágica cresceu outra vez na praça do Domínio, coberta de cores outonais! Junta-te aos teus companheiros de guilda, mostra o que vales com uma enxada na mão e ganha prémios únicos! Começa a temporada a ganhar!

source: Meet a new Titan!
pt_pt: Conhece um novo titã!

source: A Solar Skin for Oya, a x4 sale on Emeralds, and 50% discounts for spheres!
pt_pt: Um visual Solar para Oya, Esmeraldas a quadruplicar e 50% de desconto em esferas

source: Terms
pt_pt: Termos

source: Collect my reward!
pt_pt: Recolher a minha recompensa!

source: Festivities in Danger!
pt_pt: As celebrações estão em risco!

source: Rally your dream team with this skilled rookie and see what he’s capable of!
pt_pt: Reúne a tua equipa de sonho com este hábil novato e vê do que é capaz!

source: Earn Folio Souls to promote him to 2 stars!
pt_pt: Ganha almas para Folio e promove-o a 2 estrelas!

source: In our ads, we strive to capture the spirit of the game in a fun and catchy way!
pt_pt: Com os nossos anúncios, pretendemos capturar o espírito do jogo de uma forma divertida e interessante!

source: As you progress, you’ll discover lots of awesome features, and we hope you have a great time playing.
pt_pt: À medida que avanças, vais descobrir muitas características incríveis e esperamos que te divirtas à grande.

source: We think you’ll love our new Tower game at the City Gate, which rewards you with Gold, Energy, and much more!
pt_pt: Acreditamos que vais adorar o novo modo Torre no Portão da Cidade que te dá Ouro, Energia e muito mais!

source: We are constantly working on optimization and will do our best to make the game run smoother on your device.
pt_pt: Estamos constantemente a trabalhar na otimização e faremos o possível para que o jogo corra de uma forma mais suave no teu dispositivo.

source: Please contact our tech support using this form: bit.ly/HWSupport
pt_pt: Contacta o suporte técnico através deste formulário: bit.ly/HWSupport

source: Logic Games in Hero Wars!
pt_pt: Desafios de lógica no Hero Wars!

source: 1 hour
pt_pt: 1 hora

source: The Footsteps of Winter!
pt_pt: As Pegadas do Inverno!

source: Tap into Rigel's potential by joining Brawls and completing quest chains!
pt_pt: Explora o potencial de Rigel ao juntares-te a Combates e ao concluir missões!

source: While the event is active, get extra perks like 4 times as many Emeralds and great deals on Super Titan skins!
pt_pt: Enquanto o evento está ativo, obtém vantagens adicionais como 4 vezes o número de Esmeraldas e excelentes promoções em visuais de Super Titãs!

source: You're also in for some unique offers on Elemental Spheres and Bundles of Titan Skin Stones!
pt_pt: Também podes obter ofertas únicas em Esferas Elementais e conjuntos de Pedras de Visuais de Titã!

source: Sign Up
pt_pt: Regista-te

source: Join the Fight
pt_pt: Entra em ação

source: Power is yours for the taking.
pt_pt: Luta pelo poder.
